{
    "bos_token": "<s>",
    "eos_token": "</s>",
    "unk_token": "<unk>",
    "sep_token": "</s>",
    "cls_token": "<s>",
    "pad_token": "<pad>",
    "mask_token": "<mask>",
    "model_max_length": 256,
    "special_tokens_map_file": null,
    "tokenizer_file": "C:\\Users\\Admin/.cache\\huggingface\\transformers\\2a5a08bafb20e9bcf481310b8d5d7b2d98d7d55f31c84454e40123d3405a6a8c.f572e6ded8c5e21d8610bc80eb71a42fd1e4bffb7eb74701221f20ba6b0bf3f3",
    "name_or_path": "vinai/phobert-large",
    "tokenizer_class": "PhobertTokenizer"
}