{
  "_name_or_path": "vinai/phobert-large",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "B-ACCOUNT_NUMBER",
    "1": "B-ACCOUNT_NAME",
    "2": "B-DATE",
    "3": "B-UNIT_PRICE",
    "4": "B-MONEY",
    "5": "B-TAX_TYPE",
    "6": "B-TAX_RATE",
    "7": "B-VOUCHER_TYPE",
    "8": "I-ACCOUNT_NUMBER",
    "9": "I-ACCOUNT_NAME",
    "10": "I-DATE",
    "11": "I-UNIT_PRICE",
    "12": "I-MONEY",
    "13": "I-TAX_TYPE",
    "14": "I-TAX_RATE",
    "15": "I-VOUCHER_TYPE",
    "16": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-ACCOUNT_NUMBER": 0,
    "B-ACCOUNT_NAME": 1,
    "B-DATE": 2,
    "B-UNIT_PRICE": 3,
    "B-MONEY": 4,
    "B-TAX_TYPE": 5,
    "B-TAX_RATE": 6,
    "B-VOUCHER_TYPE": 7,
    "I-ACCOUNT_NUMBER": 8,
    "I-ACCOUNT_NAME": 9,
    "I-DATE": 10,
    "I-UNIT_PRICE": 11,
    "I-MONEY": 12,
    "I-TAX_TYPE": 13,
    "I-TAX_RATE": 14,
    "I-VOUCHER_TYPE": 15,
    "O": 16
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.26.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
