{
  "_name_or_path": "vinai/phobert-large",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "B-PATIENT_ID",
    "1": "B-NAME",
    "2": "B-AGE",
    "3": "B-GENDER",
    "4": "B-JOB",
    "5": "B-LOCATION",
    "6": "B-ORGANIZATION",
    "7": "B-SYMPTOM_AND_DISEASE",
    "8": "B-TRANSPORTATION",
    "9": "B-DATE",
    "10": "I-PATIENT_ID",
    "11": "I-NAME",
    "12": "I-AGE",
    "13": "I-GENDER",
    "14": "I-JOB",
    "15": "I-LOCATION",
    "16": "I-ORGANIZATION",
    "17": "I-SYMPTOM_AND_DISEASE",
    "18": "I-TRANSPORTATION",
    "19": "I-DATE",
    "20": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-PATIENT_ID": 0,
    "B-NAME": 1,
    "B-AGE": 2,
    "B-GENDER": 3,
    "B-JOB": 4,
    "B-LOCATION": 5,
    "B-ORGANIZATION": 6,
    "B-SYMPTOM_AND_DISEASE": 7,
    "B-TRANSPORTATION": 8,
    "B-DATE": 9,
    "I-PATIENT_ID": 10,
    "I-NAME": 11,
    "I-AGE": 12,
    "I-GENDER": 13,
    "I-JOB": 14,
    "I-LOCATION": 15,
    "I-ORGANIZATION": 16,
    "I-SYMPTOM_AND_DISEASE": 17,
    "I-TRANSPORTATION": 18,
    "I-DATE": 19,
    "O": 20
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.26.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
